# Name : Mario Zeng
# Email: z462949992@gmail.com
# Time : 2022/4/12 13:18

'''
   字典：字典内部数据是没有顺序的
      1、Python内置的数据结构之一,与列表一样是一个可变序列
      2、以键值的方式存储数据,字典是一个无序的序列
          scores={'张三':100, '李四':88 ,'老五':66 }
          scores为字典名;   '张三':100 ---> '张三'为键, 100为值
      3、字典示意图：
          hash(key4)   ...    ...  hash(key2)  ...  hash(key1)  ...  ...  ...  hash(key3)  hash(key5)
          — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —
         |   key4    | ... |  ... |   key2      ...    key1      ...  ...  ...    key3        key5  |
         |    ↓      |  ↓  |
         |  value4   |     |
         |_ _ _ _ _ _| _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
'''















