# Name : Mario Zeng
# Email: z462949992@gmail.com
# Time : 2022/3/30 15:01

# ②、赋值运算符

'''
        1> 执行顺序：右 → 左
赋值运算：2> 支持链式赋值：a = b = c = 20
        3> 支持参数赋值：+= 、 -= 、 *= 、 /= 、 //= 、 %=
        4> 支持系列解包赋值：a,b,c = 20,30,40
'''

# 1> 执行顺序：右 → 左
a = 3 + 4  # 先计算等式右边的运算,再赋值给a
print(a)

# 2> 支持链式赋值：a = b = c = 20
a = b = c = 20
print(a, id(a))  # 结果：20 2269743967120  链式赋值的a、b、c三个数值同时指向一个存储单元
print(b, id(b))  # 结果：20 2269743967120  链式赋值的a、b、c三个数值同时指向一个存储单元
print(c, id(c))  # 结果：20 2269743967120  链式赋值的a、b、c三个数值同时指向一个存储单元

# 3> 支持参数赋值：+= 、 -= 、 *= 、 /= 、 //= 、 %=
a = 20
a += 30  # 相当于a = a+30
print(a)

b = 20
b -= 10  # 相当于b = b-10
print(b)

c = 10
c *= 4  # 相当于c = c*4
print(c)

# 运行除法运算时要注意字符类型会转换
d = 20
print(type(d))  # 结果：<class 'int'>
d /= 3
print(d, type(d))  # 结果：6.666666666666667 <class 'float'>
d //= 2
print(d, type(d))  # 结果：3.0 <class 'float'>
d %= 2
print(d, type(d))  # 结果：1.0 <class 'float'>

# 4> 支持系列解包赋值：a,b,c = 20,30,40
a, b, c, = 20, 30, 40
print(a, b, c)  # 结果：20 30 40
# a, b = 20, 30, 40  # 报错：左右变量的个数不同
print('---------交换两个变量的值----------')
a, b = 10, 20
print('交换之前：', a, b)
a, b = b, a
print('交换之后：', a, b)




























